Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказПоставщику</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АС_ТребоватьКоличествоДнейНаВозврат</Name>
					<Comment>Технический признак: в новых заказах поставщику срок возврата обязателен, в созданных до доработки — нет.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АС_Поступление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АС_КоличествоДнейНаВозврат</Name>
							<Comment>Срок возврата поставщику в календарных днях от даты фактического поступления.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказПоставщику/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
&Вместо("СписокВыбор")
Процедура АС_СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Неопределено Или Поле.Имя <> "АС_СоставЗаказа" Тогда
		ПродолжитьВызов(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено
		Или Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	СоставЗаказа = АС_ПолучитьСоставЗаказа(Элемент.ТекущиеДанные.Ссылка);
	Если СоставЗаказа.Количество() = 0 Тогда
		ТекстНетТоваров = НСтр("ru = 'Заказанные товары отсутствуют'");
		СоставЗаказа.Добавить(ТекстНетТоваров, ТекстНетТоваров);
	КонецЕсли;
	
	АС_РасширитьПредставлениеСоставаЗаказа(СоставЗаказа);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("АС_СоставЗаказаЗавершение", ЭтотОбъект);
	ПоказатьВыборИзСписка(ОповещениеОЗакрытии, СоставЗаказа, Поле);
	
КонецПроцедуры

&НаКлиенте
Процедура АС_РасширитьПредставлениеСоставаЗаказа(СоставЗаказа)
	
	МаксимальнаяДлина = 0;
	СамаяДлиннаяСтрока = Неопределено;
	Для Каждого СтрокаСостава Из СоставЗаказа Цикл
		ДлинаСтроки = СтрДлина(СтрокаСостава.Представление);
		Если ДлинаСтроки > МаксимальнаяДлина Тогда
			МаксимальнаяДлина = ДлинаСтроки;
			СамаяДлиннаяСтрока = СтрокаСостава;
		КонецЕсли;
	КонецЦикла;
	
	Если СамаяДлиннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Заполнитель = "";
	Для ИндексСимвола = 1 По МаксимальнаяДлина * 2 Цикл
		Заполнитель = Заполнитель + Символ(160);
	КонецЦикла;
	СамаяДлиннаяСтрока.Представление = СамаяДлиннаяСтрока.Представление + Заполнитель;
	
КонецПроцедуры

&НаКлиенте
Процедура АС_СоставЗаказаЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АС_ПолучитьСоставЗаказа(ЗаказПоставщику)
	
	СоставЗаказа = Новый СписокЗначений;
	Если Не ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		Возврат СоставЗаказа;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|  Запасы.НомерСтроки КАК НомерСтроки,
	|  Запасы.Номенклатура.Артикул КАК Артикул,
	|  Запасы.Номенклатура.Наименование КАК Наименование,
	|  Запасы.Количество КАК Количество
	|ИЗ
	|  Документ.ЗаказПоставщику.Запасы КАК Запасы
	|ГДЕ
	|  Запасы.Ссылка = &ЗаказПоставщику
	|  И Запасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|
	|УПОРЯДОЧИТЬ ПО
	|  НомерСтроки";
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Артикул = СокрЛП(Выборка.Артикул);
		Количество = СокрЛП(Строка(Выборка.Количество)) + " шт.";
		Если ПустаяСтрока(Артикул) Тогда
			ТекстСтроки = СтрШаблон("%1 | %2",
				Выборка.Наименование,
				Количество);
		Иначе
			ТекстСтроки = СтрШаблон("%1 | %2 | %3",
				Артикул,
				Выборка.Наименование,
				Количество);
		КонецЕсли;
		СоставЗаказа.Добавить(ТекстСтроки, ТекстСтроки);
	КонецЦикла;
	
	Возврат СоставЗаказа;
	
КонецФункции
